app/controllers/movies_controller.rb

  def index
    #@all_ratings = Movie.all_ratings
    @all_ratings = ['G','PG','PG-13','R','NC-17']
    if session[:sort] != params[:sort] and !params[:sort].nil?
      session[:sort] = params[:sort]
    end

    if session[:ratings] != params[:ratings] and !params[:ratings].nil?
      session[:ratings] = params[:ratings]
    end

    if params[:sort].nil? and params[:ratings].nil? and (!session[:sort].nil? or !session[:ratings].nil?)
      redirect_to(movies_path(:sort => session[:sort], :ratings => session[:ratings]))
    end
    @sorted_by = session[:sort]
    @selected_ratings = session[:ratings]

    if @sorted_by.nil?
      @movies = Movie.all
    else
      @movies = Movie.order(@sorted_by)
    end

    if @selected_ratings.nil?
      @selected_ratings = @all_ratings
    else
      @selected_ratings = @selected_ratings.keys
    end

    if @sorted_by.nil?
       @movies = Movie.find_all_by_rating(@selected_ratings)
---
SELECT "movies".* FROM "movies" ORDER BY release_date ASC
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R', 'NC-17') ORDER BY release_date